/*
F. Лифт
Тридцатого декабря все сотрудники известной IT-компании отправляются праздновать Новый год! На парковке офиса сотрудников уже ожидают автобусы, чтобы отвезти их в ресторан. Известно, что на i-м этаже работает ai сотрудников, а парковка расположена на нулевом этаже. Изначально лифт расположен на этаже с парковкой. Какое минимальное количество времени лифт будет перевозить всех людей на парковку? Известно, что лифт движется со скоростью один этаж в секунду, а посадка и высадка происходит мгновенно.

Формат ввода
В первой строке дано единственное целое число k(1≤k≤10^9) — количество людей, которое вмещает лифт за одну поездку. Во второй строке дано единственное целое число n — количество этажей в здании. В следующих n(1≤n≤10^5) строках дано по одному целому неотрицательному числу ai(0≤ai≤10^9), которое обозначает количество сотрудников на этаже номер i.

Формат вывода
Выведите единственное целое число  — минимальное количество секунд, которое необходимо, чтобы все сотрудники оказались на парковке.
*/

#include <iostream>
#include <vector>

int main()
{
	unsigned long long int k, n;
	std::cin >> k >> n;
	std::vector<unsigned long long int> data(n);
	for (int i = 0; i < n; ++i)
		std::cin >> data[i];

	int free_place = 0;
	unsigned long long int time = 0;
	unsigned long long int time_to_delieve = n;
	for (int i = n - 1; i >= 0 ; --i)
	{
		unsigned long long int x = data[i];
		if (free_place >= x)
			free_place -= x;
		else
		{
			x -= free_place;
			time += (x / k + (x % k ? 1 : 0)) * time_to_delieve * 2;
			if (x % k)
				free_place = k - x % k;
			else
				free_place = 0;
		}
		--time_to_delieve;
	}
	std::cout << time << std::endl;
	return 0;
}
